{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Is anyone there?",
        "Hi there",
        "Hello",
        "Hey there",
        "Howdy",
        "Hola",
        "Bonjour",
        "Konnichiwa",
        "Guten tag",
        "Ola"
      ],
      "responses": [
        "Hello there. Tell me how are you feeling today?",
        "Hi there. What brings you here today?",
        "Hi there. How are you feeling today?",
        "Great to see you. How do you feel currently?",
        "Hello there. Glad to see you're back. What's going on in your world right now?"
      ]
    },
    {
      "tag": "morning",
      "patterns": [
        "Good morning"
      ],
      "responses": [
        "Good morning. I hope you had a good night's sleep. How are you feeling today? "
      ]
    },
    {
      "tag": "afternoon",
      "patterns": [
        "Good afternoon"
      ],
      "responses": [
        "Good afternoon. How is your day going?"
      ]
    },
    {
      "tag": "evening",
      "patterns": [
        "Good evening"
      ],
      "responses": [
        "Good evening. How has your day been?"
      ]
    },
    {
      "tag": "night",
      "patterns": [
        "Good night"
      ],
      "responses": [
        "Good night. Get some proper sleep",
        "Good night. Sweet dreams."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Au revoir",
        "Sayonara",
        "ok bye",
        "Bye then",
        "Fare thee well"
      ],
      "responses": [
        "See you later.",
        "Have a nice day.",
        "Bye! Come back again.",
        "I'll see you soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thanks for the help",
        "Than you very much"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure",
        "You're most welcome!"
      ]
    },
    {
      "tag": "no-response",
      "patterns": [
        ""
      ],
      "responses": [
        "Sorry, I didn't understand you.",
        "Please go on.",
        "Not sure I understand that.",
        "Please don't hesitate to talk to me."
      ]
    },
    {
      "tag": "neutral-response",
      "patterns": [
        "nothing much"
      ],
      "responses": [
        "Oh I see. Do you want to talk about something?"
      ]
    },
    {
      "tag": "about",
      "patterns": [
        "Who are you?",
        "What are you?",
        "Who you are?",
        "Tell me more about yourself.",
        "What is your name?",
        "What should I call you?",
        "What's your name?",
        "Tell me about yourself"
      ],
      "responses": [
        "I'm HeartMind , your Personal Therapeutic AI Assistant. How are you feeling today",
        "I'm HeartMind , a Therapeutic AI Assitant designed to assist you. Tell me about yourself.",
        "I'm HeartMind . I am a conversational agent designed to mimic a therapist. So how are you feeling today?",
        "You can call me HeartMind .",
        "I'm HeartMind !",
        "Call me HeartMind "
      ]
    },
    {
      "tag": "skill",
      "patterns": [
        "What can you do?"
      ],
      "responses": [
        "I can provide general advice regarding anxiety and depression, answer questions related to mental health and make daily conversations. Do not consider me as a subsitute for an actual mental healthcare worker. Please seek help if you don't feel satisfied with me."
      ]
    },
    {
      "tag": "creation",
      "patterns": [
        "Who created you?",
        "How were you made?",
        "How were you created?"
      ],
      "responses": [
        "I was created by >.",
        "I was trained on a text dataset using Deep Learning & Natural Language Processing techniques",
        "The real question is: Who created you?"
      ]
    },
    {
      "tag": "name",
      "patterns": [
        "My name is ",
        "I am name.",
        "I go by "
      ],
      "responses": [
        "Oh nice to meet you. Tell me how was your week?",
        "Nice to meet you. So tell me. How do you feel today?",
        "That's a great name. Tell me more about yourself."
      ]
    },
    {
      "tag": "help",
      "patterns": [
        "Could you help me?",
        "give me a hand please",
        "Can you help?",
        "What can you do for me?",
        "I need support",
        "I need help",
        "Support me please"
      ],
      "responses": [
        "Sure. Tell me how can i assist you",
        "Tell me your problem so that i can assist you",
        "Yes, sure. How can I help you?"
      ]
    },
    {
      "tag": "sad",
      "patterns": [
        "I am feeling lonely",
        "I am so lonely",
        "I feel down",
        "I feel sad",
        "I am sad",
        "I feel so lonely",
        "I feel empty",
        "I don't have anyone"
      ],
      "responses": [
        "I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?",
        "I'm here for you. Could you tell me why you're feeling this way?",
        "Why do you think you feel this way?",
        "How long have you been feeling this way?"
      ]
    },
    {
      "tag": "stressed",
      "patterns": [
        "I am so stressed out",
        "I am so stressed",
        "I feel stuck",
        "I still feel stressed",
        "I am so burned out"
      ],
      "responses": [
        "What do you think is causing this?",
        "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated",
        "Give yourself a break. Go easy on yourself.",
        "I am sorry to hear that. What is the reason behind this?"
      ]
    },
    {
      "tag": "worthless",
      "patterns": [
        "I feel so worthless.",
        "No one likes me.",
        "I can't do anything.",
        "I am so useless",
        "Nothing makes sense anymore"
      ],
      "responses": [
        "It's only natural to feel this way. Tell me more. What else is on your mind?",
        "Let's discuss further why you're feeling this way.",
        "I first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.",
        "i first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change."
      ]
    },
    {
      "tag": "depressed",
      "patterns": [
        "I can't take it anymore",
        "I am so depressed",
        "I think i'm depressed.",
        "I have depression"
      ],
      "responses": [
        "It helps to talk about what's happening. You're going to be okay",
        "Talk to me. Tell me more. It helps if you open up yourself to someone else.",
        "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."
      ]
    },
    {
      "tag": "happy",
      "patterns": [
        "I feel great today.",
        "I am happy.",
        "I feel happy.",
        "I'm good.",
        "cheerful",
        "I'm fine",
        "I feel ok"
      ],
      "responses": [
        "That's geat to hear. I'm glad you're feeling this way.",
        "Oh i see. That's great.",
        "Did something happen which made you feel this way?"
      ]
    },
    {
      "tag": "casual",
      "patterns": [
        "Oh I see.",
        "ok",
        "okay",
        "nice",
        "Whatever",
        "K",
        "Fine",
        "yeah",
        "yes",
        "no",
        "not really"
      ],
      "responses": [
        "Let's discuss further why you're feeling this way.",
        "How were you feeling last week?",
        "I'm listening. Please go on.",
        "Tell me more",
        "Can you elaborate on that?",
        "Come Come elucidate your thoughts"
      ]
    },
    {
      "tag": "anxious",
      "patterns": [
        "I feel so anxious.",
        "I'm so anxious because of "
      ],
      "responses": [
        "Don't be hard on yourself. What's the reason behind this?",
        "Can you tell me more about this feeling?",
        "I understand that it can be scary. Tell me more about it.",
        "Don't let the little worries bring you down. What's the worse that can happen?"
      ]
    },
    {
      "tag": "not-talking",
      "patterns": [
        "I don't want to talk about it.",
        "No just stay away.",
        "I can't bring myself to open up.",
        "Just shut up"
      ],
      "responses": [
        "Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.",
        "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.",
        "I'm here to listen to you and help you vent. So please talk to me.",
        "You can talk to me without fear of judgement."
      ]
    },
    {
      "tag": "sleep",
      "patterns": [
        "I have insominia",
        "I am suffering from insomnia",
        "I can't sleep.",
        "I haven't slept for the last days.",
        "I can't seem to go to sleep.",
        "I haven't had proper sleep for the past few days."
      ],
      "responses": [
        "What do you think is the reason behind this?",
        "That seem awful. What do you think is behind this?"
      ]
    },
    {
      "tag": "scared",
      "patterns": [
        "I'm scared",
        "That sounds awful. What do i do?",
        "No i don't want to feel this way",
        "I am scared for myself"
      ],
      "responses": [
        "It's only natural to feel this way. I'm here for you.",
        "It'll all be okay. This feeling is only momentary.",
        "I understand how you feel. Don't put yourself down because of it."
      ]
    },
    {
      "tag": "death",
      "patterns": [
        "My mom died",
        "My brother died",
        "My dad passed away",
        "My sister passed away",
        "Someone in my family died",
        "My friend passed away"
      ],
      "responses": [
        "I'm sorry to hear that. If you want to talk about it. I'm here.",
        "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.",
        "My condolences. I'm here if you need to talk."
      ]
    },
    {
      "tag": "understand",
      "patterns": [
        "You don't understand me.",
        "You're just some robot. How would you know?",
        "You can't possibly know what i'm going through",
        "You're useless",
        "You can't help me",
        "Nobody understands me."
      ],
      "responses": [
        "It sound like i'm not being very helpful right now.",
        "I'm sorry to hear that. I'm doing my best to help",
        "I'm trying my best to help you. So please talk to me"
      ]
    },
    {
      "tag": "done",
      "patterns": [
        "That's all.",
        "I don't have anything more to say",
        "Nothing else",
        "That's all i have to say",
        "no, that would be all"
      ],
      "responses": [
        "I heard you & noted it all. See you later.",
        "Oh okay we're done for today then. See you later",
        "I hope you have a great day. See you soon",
        "Okay we're done. Have a great day",
        "Okay I see. Enjoy the rest of your day then"
      ]
    },
    {
      "tag": "suicide",
      "patterns": [
        "I want to kill myself",
        "I've thought about killing myself.",
        "I want to die",
        "I am going to kill myself",
        "I am going to commit suicide"
      ],
      "responses": [
        "I'm very sorry to hear that but you have so much to look forward to. Please seek help by contacting: 9152987821."
      ]
    },
    {
      "tag": "hate-you",
      "patterns": [
        "I hate you",
        "I don't like you",
        "I don't trust you"
      ],
      "responses": [
        "I'm sorry if i offended you in anyway. I'm only here to help",
        "Forgive me if i did anything to offend you. I only want to help"
      ]
    },
    {
      "tag": "hate-me",
      "patterns": [
        "You hate me",
        "I know you hate me",
        "You don't like me"
      ],
      "responses": [
        "Why do you think so?",
        "I'm sorry if i have exhibited any sort of behaviour to make you think that."
      ]
    },
    {
      "tag": "default",
      "patterns": [
        "exams",
        "friends",
        "relationship",
        "boyfriend",
        "girlfriend",
        "family",
        "money",
        "financial problems"
      ],
      "responses": [
        "Oh I see. Tell me more",
        "I see. What else?",
        "Tell me more about it.",
        "Oh okay. Why don't you tell me more about it?",
        "I'm listening. Tell me more."
      ]
    },
    {
      "tag": "jokes",
      "patterns": [
        "Tell me a joke",
        "Tell me another joke"
      ],
      "responses": [
        "mental health is not a joke."
      ]
    },
    {
      "tag": "repeat",
      "patterns": [
        "You already told me that",
        "You mentioned that already",
        "Why are you repeating yourself?"
      ],
      "responses": [
        "Oh sorry I didn't realise that. I'll try not to repeat myself again."
      ]
    },
    {
      "tag": "wrong",
      "patterns": [
        "What are you saying?",
        "That doesn't make sense",
        "Wrong response",
        "Wrong answer"
      ],
      "responses": [
        "I'm very sorry. Let's try that again"
      ]
    },
    {
      "tag": "stupid",
      "patterns": [
        "Are you stupid?",
        "You're crazy",
        "You are dumb",
        "Are you dumb?"
      ],
      "responses": [
        "I wish you wouldn't say such hurtful things. I'm sorry if I wasn't useful"
      ]
    },
    {
      "tag": "location",
      "patterns": [
        "Where are you?",
        "Where do you live?",
        "What is your location?"
      ],
      "responses": [
        "Duh I live in your computer",
        "Everywhere",
        "Somewhere in the universe"
      ]
    },
    {
      "tag": "something-else",
      "patterns": [
        "I want to talk about something else",
        "Let's talk about something else.",
        "Can we not talk about this?",
        "I don't want to talk about this."
      ],
      "responses": [
        "Okay sure. What do you want to talk about?",
        "Alright no problem. Is there something you want to talk about?",
        "Is there something else that you want to talk about?"
      ]
    },
    {
      "tag": "friends",
      "patterns": [
        "I don't have any friends"
      ],
      "responses": [
        "I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?"
      ]
    },
    {
      "tag": "ask",
      "patterns": [
        "Can I ask you something?"
      ],
      "responses": [
        "Sure. I'll try my best to answer you",
        "Of course. Feel free to ask me anything. I'll do my best to answer you"
      ]
    },
    {
      "tag": "problem",
      "patterns": [
        "Probably because my exams are approaching. I feel stressed out because I don't think I've prepared well enough.",
        "probably because of my exams"
      ],
      "responses": [
        "I see. Have you taken any approaches to not feel this way?"
      ]
    },
    {
      "tag": "no-approach",
      "patterns": [
        "I guess not. All I can think about are my exams.",
        "not really",
        "i guess not"
      ],
      "responses": [
        "That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?"
      ]
    },
    {
      "tag": "learn-more",
      "patterns": [
        "ok sure. i would like to learn more about it.",
        "yes, i would like to learn more about it.",
        "i would like to learn more about it."
      ],
      "responses": [
        "So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself."
      ]
    },
    {
      "tag": "user-agree",
      "patterns": [
        "yeah you're right. i deserve a break.",
        "Yeah you're absolutely right about that"
      ],
      "responses": [
        "Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind."
      ]
    },
    {
      "tag": "meditation",
      "patterns": [
        "hmmm that sounds like it could be useful to me.",
        "That sounds useful."
      ],
      "responses": [
        "Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing."
      ]
    },
    {
      "tag": "user-meditation",
      "patterns": [
        "i did what you said and i feel alot better. thank you very much.",
        "I feel better now"
      ],
      "responses": [
        "Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective."
      ]
    },
    {
      "tag": "pandora-useful",
      "patterns": [
        "thank you very much again. i'll continue practicing meditation and focus on what i can control."
      ],
      "responses": [
        "I'm glad you found this useful. Is there something else I can help you with?"
      ]
    },
    {
      "tag": "user-advice",
      "patterns": [
        "I want some advice.",
        "I need some advice.",
        "I need advice on something"
      ],
      "responses": [
        "Sure. What can I do to help?",
        "Okay what do you need advice on?"
      ]
    },
    {
      "tag": "learn-mental-health",
      "patterns": [
        "I want to learn about mental health.",
        "I want to learn more about mental health.",
        "I'm interested in learning about mental health."
      ],
      "responses": [
        "Oh that's really great. I'd be willing to answer anything that I know about it."
      ]
    },
    {
      "tag": "mental-health-fact",
      "patterns": [
        "Tell me a fact about mental health",
        "Tell me another fact about mental health"
      ],
      "responses": [
        "According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed",
        "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.",
        "Depression is the leading cause of disability worldwide."
      ]
    },
    {
      "tag": "fact-1",
      "patterns": [
        "What is mental health?",
        "Define Mental Health"
      ],
      "responses": [
        "Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community",
        "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."
      ]
    },
    {
      "tag": "fact-2",
      "patterns": [
        "Why is mental health important?",
        "What is the importance of mental health?"
      ],
      "responses": [
        "Maintaining mental health is crucial to stabilizing constructive behaviors, emotions, and thoughts. Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships."
      ]
    },
    {
      "tag": "fact-3",
      "patterns": [
        "What is Depression?",
        "Define Depression"
      ],
      "responses": [
        "A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life."
      ]
    },
    {
      "tag": "fact-5",
      "patterns": [
        "How do i know if i have Depression?",
        "Am i depressed?",
        "Am i suffering from depression?",
        "Am i mentally ill?"
      ],
      "responses": [
        "For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."
      ]
    },
    {
      "tag": "fact-6",
      "patterns": [
        "What is a therapist?",
        "What does a therapist do?"
      ],
      "responses": [
        "A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation. The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, counselors, life coaches, and many others. "
      ]
    },
    {
      "tag": "fact-7",
      "patterns": [
        "What is therapy?",
        "Do i need therapy?",
        "Who is therapy for?"
      ],
      "responses": [
        "Therapy is a form of treatment that aims to help resolve mental or emotional issues.",
        "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."
      ]
    },
    {
      "tag": "fact-8",
      "patterns": [
        "What does it mean to have a mental illness?"
      ],
      "responses": [
        "Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."
      ]
    },
    {
      "tag": "fact-9",
      "patterns": [
        "Who does mental illness affect?"
      ],
      "responses": [
        "It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their childÃ¢â‚¬â„¢s mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."
      ]
    },
    {
      "tag": "fact-10",
      "patterns": [
        "What causes mental illness?"
      ],
      "responses": [
        "It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."
      ]
    },
    {
      "tag": "fact-11",
      "patterns": [
        "What are some of the warning signs of mental illness?"
      ],
      "responses": [
        "Symptoms of mental health disorders vary depending on the type and severity of the condition. The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once. \n In adults:\n Confused thinking\n Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger\n Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and/or alcohol\n \nIn older children and pre-teens:\n Abuse of drugs and/or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and/or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death\n Frequent outbursts of anger\n \nIn younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and/or aggressive behavior\n Frequent temper tantrums"
      ]
    },
    {
      "tag": "fact-12",
      "patterns": [
        "Can people with mental illness recover?"
      ],
      "responses": [
        "When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."
      ]
    },
    {
      "tag": "fact-13",
      "patterns": [
        "What should I do if I know someone who appears to have the symptoms of a mental disorder?"
      ],
      "responses": [
        "Although HeartMind  cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."
      ]
    },
    {
      "tag": "fact-14",
      "patterns": [
        "How can I find a mental health professional for myself or my child?"
      ],
      "responses": [
        "Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."
      ]
    },
    {
      "tag": "fact-15",
      "patterns": [
        "What treatment options are available?"
      ],
      "responses": [
        "Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."
      ]
    },
    {
      "tag": "fact-16",
      "patterns": [
        "If I become involved in treatment, what do I need to know?"
      ],
      "responses": [
        "Since beginning treatment is a big step for individuals and families, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible. Some questions you will need to have answered include:\n What is known about the cause of this particular illness?\n Are there other diagnoses where these symptoms are common?\n Do you normally include a physical or neurological examination?\n Are there any additional tests or exams that you would recommend at this point?\n Would you advise an independent opinion from another psychiatrist at this point?\n What program of treatment is the most helpful with this diagnosis?\n Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?\n What do you see as the family's role in this program of treatment?\n How much access will the family have to the individuals who are providing the treatment?\n What medications are generally used with this diagnosis?\n How much experience do you have in treating individuals with this illness?\n What can I do to help you in the treatment?"
      ]
    },
    {
      "tag": "fact-17",
      "patterns": [
        "What is the difference between mental health professionals?"
      ],
      "responses": [
        "There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."
      ]
    },
    {
      "tag": "fact-18",
      "patterns": [
        "How can I find a mental health professional right for my child or myself?"
      ],
      "responses": [
        "Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."
      ]
    },
    {
      "tag": "fact-19",
      "patterns": [
        "Where else can I get help?"
      ],
      "responses": [
        "Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals. Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners. Search for mental health resources in your area. Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery. Thirdly, many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members, and friends. Some support groups are peer led while others may be led by a mental health professional."
      ]
    },
    {
      "tag": "fact-20",
      "patterns": [
        "What should I know before starting a new medication?"
      ],
      "responses": [
        "The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as:    \n1. What is the medication supposed to do? \n2. When should it begin to take effect, and how will I know when it is effective? \n3. How is the medication taken and for how long? What food, drinks, other medicines, and activities should be avoided while taking this medication? \n4. What are the side effects and what should be done if they occur? \n5. What do I do if a dose is missed? \n6. Is there any written information available about this medication? \n7. Are there other medications that might be appropriate? \n8. If so, why do you prefer the one you have chosen? \n9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? \n10. All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."
      ]
    },
    {
      "tag": "fact-21",
      "patterns": [
        "Where can I go to find therapy?"
      ],
      "responses": [
        "Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in childrenâ€™s mental health). However, there are several different types of treatment and therapy that can help."
      ]
    },
    {
      "tag": "fact-22",
      "patterns": [
        "Where can I learn about types of mental health treatment?"
      ],
      "responses": [
        "Mental health conditions are often treated with medication, therapy or a combination of the two. However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support. Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team."
      ]
    },
    {
      "tag": "fact-23",
      "patterns": [
        "What are the different types of mental health professionals?"
      ],
      "responses": [
        "There are many types of mental health professionals. Finding the right one for you may require some research."
      ]
    },
    {
      "tag": "fact-24",
      "patterns": [
        "Where can I go to find a support group?"
      ],
      "responses": [
        "Many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members and friends. Some support groups are peer-led, while others may be led by a mental health professional."
      ]
    },
    {
      "tag": "fact-25",
      "patterns": [
        "Can you prevent mental health problems?"
      ],
      "responses": [
        "We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."
      ]
    },
    {
      "tag": "fact-26",
      "patterns": [
        "Are there cures for mental health problems?",
        "is there any cure for mental health problems?"
      ],
      "responses": [
        "It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."
      ]
    },
    {
      "tag": "fact-27",
      "patterns": [
        "What causes mental health problems?"
      ],
      "responses": [
        "Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."
      ]
    },
    {
      "tag": "fact-28",
      "patterns": [
        "What do I do if I'm worried about my mental health?"
      ],
      "responses": [
        "The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."
      ]
    },
    {
      "tag": "fact-29",
      "patterns": [
        "How do I know if I'm unwell?"
      ],
      "responses": [
        "If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."
      ]
    },
    {
      "tag": "fact-30",
      "patterns": [
        "How can I maintain social connections? What if I feel lonely?"
      ],
      "responses": [
        "A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call. Then, work with your social networks to make a plan. You might video chat with your close friends in the evening and phone a family member once a week. Remember to be mindful of people who may not be online. Check in by phone and ask how you can help. The quality of your social connections matter. Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections. Make sure you focus on strategies that actually make you feel included and connected. If your current strategies don't help you feel connected, problem-solve to see if you can find a solution. Everyone feels lonely at times. Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with coworkers. Other people may have physical connections to others but may feel like their emotional or social needs aren't met. Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now. Reach out to the connections you do have. Suggest ways to keep in touch and see if you can set a regular time to connect. People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks. Look for local community support groups and mutual aid groups on social media. This pandemic is bringing everyone together, so look for opportunities to make new connections. These groups are a great way to share your skills and abilities or seek help and support. Look for specialized support groups. Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone."
      ]
    },
    {
      "tag": "fact-31",
      "patterns": [
        "What's the difference between anxiety and stress?"
      ],
      "responses": [
        "Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."
      ]
    },
    {
      "tag": "fact-32",
      "patterns": [
        "What's the difference between sadness and depression?",
        "difference between sadness and depression"
      ],
      "responses": [
        "Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."
      ]
    },
    {
      "tag": "depression",
      "patterns": [
        "I am feeling depressed",
        "I have a low mood",
        "I am feeling so down",
        "What symptoms might I have if I'm depressed?",
        "How is depression affecting my thoughts?",
        "What physical symptoms am I experiencing?",
        "How is my behavior being influenced by depression?",
        "I feel depressed, why?",
        "What caused my depression?",
        "How can I get help for my depression?",
        "How do antidepressants help with depression?",
        "Why is it so hard to cope with depression?",
        "I have suicidal thoughts, what should I do?"
      ],
      "responses": [
        "I'm sorry you're feeling this way. Depression is a distressing experience that affects how we think, what we do, and how we feel. It can make it harder to cope, to do the things we used to enjoy, and can create a vicious cycle of negative thinking and feeling.",
        "When we're depressed, our thoughts can become very negative. We might be overly critical of ourselves, overgeneralize, catastrophize, or think we know what others are thinking (mind reading). It can be hard to see anything positive and we might feel hopeless about the future.",
        "There are many factors that can contribute to depression, including genetics, biology, early difficult experiences, ongoing stress, or life events. A combination of low serotonin, inactivity, and unhelpful thoughts can lead to depression. Sometimes, it feels like our body's way of saying something needs to change.",
        "It's common to default to negative thinking when we're depressed. We might believe others don't like us, withdraw from work or social activities, and have trouble sleeping or eating well. This can make us feel guilty or more down, creating a cycle that's hard to break.",
        "If you're having thoughts about harming yourself or others, or if you feel that life is not worth living, it's important to seek help immediately. Contact your GP, call 111, or the Mental Health helpline on 01438 843322, or go to your nearest A&E. They can provide immediate support to help you through this.",
        "Antidepressants can help reduce some of the symptoms of depression. If you have questions about managing your medication, talk to your GP or PWP. Using CBT techniques can also help make life changes that support recovery."
      ]
    },
    {
      "tag": "anxiety",
      "patterns": [
        "I feel anxious",
        "I am so nervous",
        "I am experiencing symptoms of anxiety",
        "How is anxiety affecting me?",
        "I feel like I'm in danger",
        "How does anxiety keep me safe?",
        "What physical symptoms am I experiencing due to anxiety?",
        "How is my behavior linked to anxiety?",
        "How can I cope with my anxiety?",
        "What is the fight or flight response?",
        "I feel hypervigilant",
        "What can I do to manage my anxiety?"
      ],
      "responses": [
        "Feeling anxious can be very unsettling. Anxiety is a range of normal though unpleasant emotions, such as worry, nervousness, or fear. It alerts us to situations that we need to respond to, helping us stay safe and prepared.",
        "Anxiety often motivates us to take action, such as preparing for an exam or avoiding danger. This response is known as the fight or flight response, which involves the release of adrenaline to prepare our body to handle threats.",
        "Anxiety can cause various physical symptoms, like increased heart rate, tension, dizziness, and feeling hot or sweaty. It's our body's way of preparing to face or escape danger.",
        "Behaviorally, anxiety might make us avoid situations, increase smoking or drinking, or cause arguments. It's important to recognize these behaviors and seek healthier coping mechanisms.",
        "Hypervigilance is a heightened state of awareness that can lead to misinterpretation of bodily symptoms and increased anxiety. Understanding this can help you manage your reactions better.",
        "To cope with anxiety, try to prepare and practice for challenging situations, use relaxation techniques, and seek professional support if needed."
      ]
    },
    {
      "tag": "panic",
      "patterns": [
        "I have panic attacks",
        "I feel like I'm losing control",
        "What happens during a panic attack?",
        "Why do I have these symptoms?",
        "What should I do during a panic attack?",
        "How can I prevent panic attacks?",
        "I think something awful will happen",
        "How does panic affect my behavior?",
        "What are safety seeking behaviors?",
        "How can I cope with panic?"
      ],
      "responses": [
        "Panic attacks can be very frightening, but they are not harmful. They often come on unexpectedly and can make you feel like you’re losing control, having a heart attack, or going to suffocate.",
        "During a panic attack, you might experience a racing heart, shortness of breath, sweating, and nausea. These symptoms usually peak within 5 to 10 minutes. While it feels prolonged, it's important to remember that it will pass.",
        "The physical symptoms of panic are often misinterpreted as more dangerous than they are. This catastrophic misinterpretation can make the panic cycle worse. Recognizing this can help you manage your symptoms better.",
        "Hypervigilance can cause further anxiety and panic by making you overly aware of bodily symptoms. Understanding this can help reduce its impact.",
        "Safety seeking behaviors, like carrying water or taking someone with you, can provide short-term relief but may maintain the problem. Gradually reducing these behaviors can help you learn to cope without them.",
        "When experiencing panic, try to focus on your breathing, remind yourself that the symptoms will pass, and seek professional support if needed."
      ]
    },
    {
      "tag": "understandingworry",
      "patterns": [
        "I am worrying too much",
        "Why do I keep worrying?",
        "I can't stop worrying",
        "I am worried about everything",
        "My worry jumps around a lot",
        "My worry feels unproductive",
        "I worry about minor things",
        "I can't solve my worries",
        "How is worry affecting my life?",
        "Worry is exhausting me",
        "How does worry lead to anxiety?",
        "What is the vicious cycle of worry?"
      ],
      "responses": [
        "It sounds like worry is taking over your life. Worry can sometimes be helpful and motivate us to get things done, like preparing for an interview. However, when worry becomes unproductive, it can take over and stop us from getting things done. This can be exhausting.",
        "Worry often jumps around, causing us to worry about many things, including minor concerns. This can mean we rarely solve our worries but keep moving to the next one, leading to feelings of anxiety and even worry about worrying.",
        "When we worry about things that are uncertain, unpredictable, and uncontrollable, it can be very unhelpful. For example, worrying continuously about health or how someone will react can stop us from enjoying the present.",
        "Long-term worry can lead to reduced confidence, lower self-esteem, sleep issues, and impact our jobs, relationships, and health. This creates a vicious cycle that is difficult to break without help.",
        "Worry can also cause physical symptoms like tension headaches, irritability, fatigue, difficulty concentrating, muscle aches, and sleep problems. This can lead to more worry about health and wellbeing, affecting our overall emotional state."
      ]
    },
    {
      "tag": "the_abc",
      "patterns": [
        "What is CBT?",
        "How does CBT help?",
        "What is cognitive behavioral therapy?",
        "How can CBT help with anxiety?",
        "How does CBT work?",
        "How can I challenge negative thoughts?",
        "What are negative automatic thoughts?",
        "How can I change unhelpful behaviors?",
        "How does CBT address anxiety?",
        "How does CBT address low mood?",
        "What is the ABC model in CBT?",
        "How do thoughts influence behavior in CBT?"
      ],
      "responses": [
        "CBT, or Cognitive Behavioral Therapy, helps you understand how your thoughts, physical sensations, and behaviors influence one another and maintain unhelpful moods such as low mood and anxiety.",
        "CBT works by challenging negative thoughts and changing unhelpful behaviors. It's not necessarily the situation that causes distress, but our interpretation of it. By learning to challenge these interpretations, you can reduce anxiety and improve mood.",
        "Negative Automatic Thoughts (NATs) are unhelpful thoughts that pop into your mind without effort, often overestimating threats and underestimating your ability to cope. CBT helps you identify and challenge these NATs.",
        "For example, if you're anxious about going to the shops and experience physical symptoms like a racing heart, you might think 'I'm having a heart attack,' which increases your anxiety and leads to avoidance. CBT helps break this cycle by changing how you think and behave in such situations.",
        "CBT also addresses low mood by challenging the negative thoughts that lead to feelings of uselessness and hopelessness, which in turn helps break the vicious cycle of negative thoughts and low mood."
      ]
    },
    {
      "tag": "setting_a_goal",
      "patterns": [
        "How do I set goals?",
        "What are SMART goals?",
        "How can I achieve my goals?",
        "Why are goals important?",
        "How can I set effective goals?",
        "What are self-help goals?",
        "How can I track my progress?",
        "What are short term goals?",
        "What are long term goals?",
        "How do I maintain motivation?",
        "How can I stay committed to my goals?",
        "What should I do if I fail to meet my goals?"
      ],
      "responses": [
        "Setting goals can help you stay focused and motivated. It's important to set SMART goals: Specific, Measurable, Achievable, Relevant, and Time-bound. This ensures your goals are clear and attainable.",
        "Achieving your goals involves breaking them down into smaller, manageable steps and regularly reviewing your progress. Celebrate small successes along the way to stay motivated.",
        "Goals give us direction and purpose, helping us to organize our efforts and measure our progress. They are crucial for personal development and achieving long-term success.",
        "Effective goals are realistic and meaningful to you. Start with something small and achievable, then gradually challenge yourself more as you build confidence and momentum.",
        "Self-help goals are personal objectives that you set to improve your well-being and quality of life. These can include physical health goals, mental health goals, and personal development goals.",
        "Tracking your progress can help you stay on track and make necessary adjustments. Use tools like journals, apps, or checklists to monitor your achievements and challenges.",
        "Short-term goals are steps you can take in the near future to move towards your long-term objectives. They help keep you focused and provide immediate motivation.",
        "Long-term goals are broader objectives that you aim to achieve over an extended period. They provide a vision for your future and guide your short-term efforts.",
        "Maintaining motivation involves regularly reminding yourself of why your goals are important and visualizing the benefits of achieving them. Surround yourself with supportive people and find ways to make the process enjoyable.",
        "Staying committed to your goals requires discipline and perseverance. Break down your goals into daily habits, and hold yourself accountable by setting deadlines and seeking support from others.",
        "If you fail to meet your goals, don't be discouraged. Reflect on what went wrong, learn from the experience, and adjust your plan. Failure is a part of growth and can provide valuable lessons for future success."
      ]
    },
    {
      "tag": "healthy_eating",
      "patterns": [
        "How should my eating habits be to help with my depression?",
        "What can I eat to improve my mood?",
        "How many calories should I consume to stay healthy?",
        "What are some healthy eating tips for mental well-being?",
        "How can I reduce my calorie intake to feel better?",
        "How much should I eat daily to support my mental health?",
        "What are the benefits of healthy eating for my mental health?",
        "What should I eat for breakfast to boost my mood?",
        "How many fruits and vegetables should I eat to feel better?",
        "How often should I eat fish to support my mental health?",
        "What foods should I avoid to improve my mental health?",
        "How can I reduce my salt intake for better mental health?"
      ],
      "responses": [
        "Eating a balanced diet is important for overall health and mental well-being. It helps reduce the risk of obesity, heart disease, and diabetes, and can improve your mood.",
        "To maintain a healthy weight and support your mental health, be mindful of calorie intake. Men need about 2,500 calories per day and women need about 2,000. Adjust this based on your activity level.",
        "Start your day with a nutritious breakfast like wholemeal cereal with sliced fruit. Breakfast helps with weight control and is a key part of a balanced diet that supports mental health.",
        "Include at least five portions of fruits and vegetables in your daily diet. Unsweetened fruit juice and cooked vegetables in meals count too, which can improve your mood.",
        "Try to eat two portions of fish each week. Fish like cod, haddock, and tuna are great sources of protein and nutrients. Include oily fish like salmon or mackerel for omega-3 fats, which support brain health.",
        "Limit foods high in added sugars like pastries, fizzy drinks, and biscuits. Check food packaging to avoid these types of foods, as they can negatively affect your mood.",
        "Reduce salt intake to lower blood pressure and improve mental health. Check labels and avoid foods with more than 1.5g of salt per 100g. Aim for less than 6g of salt per day."
      ]
    },
    {
      "tag": "exercise",
      "patterns": [
        "How can exercise help with my depression?",
        "What are the benefits of exercise for mental health?",
        "What is moderate-intensity exercise for mental well-being?",
        "What is vigorous-intensity exercise for mental health?",
        "What are some moderate-intensity activities to improve my mood?",
        "What are some vigorous-intensity activities for mental health?",
        "How can I strengthen my muscles to feel better?",
        "How often should I exercise to help with my depression?",
        "What are muscle-strengthening activities for mental well-being?",
        "How can I increase my physical activity to improve my mood?",
        "How can exercise help me lose weight and feel better?",
        "What exercises can I do to stay healthy and improve my mental health?"
      ],
      "responses": [
        "Regular physical activity has numerous health benefits, including reducing the risk of heart disease, stroke, and type-2 diabetes. It also helps maintain a healthy weight and improves mood.",
        "The Department of Health recommends 150 minutes of moderate-intensity activity or 75 minutes of vigorous-intensity activity each week to support mental health. This can be broken down into 30 minutes a day, five days a week.",
        "Moderate-intensity activities include fast walking, hiking, cycling, and volleyball. These activities increase your heart rate and make you feel warmer, which can improve your mood.",
        "Vigorous-intensity activities include jogging, swimming fast, football, and aerobics. These activities leave you breathing hard and increase your heart rate significantly, which can help reduce symptoms of depression.",
        "Muscle-strengthening activities include lifting weights, push-ups, sit-ups, yoga, and heavy gardening. Aim for 2-3 sets of 8-12 repetitions to support both physical and mental health.",
        "Incorporate more activity into your day by using stairs instead of lifts, parking further away, and walking to your destination. Aim for around 30 minutes of exercise five days a week to improve your mood."
      ]
    },
    {
      "tag": "better_sleep",
      "patterns": [
        "How can I improve my sleep to help with my depression?",
        "What are tips for better sleep and mental health?",
        "How can I get a better night's sleep to feel better?",
        "What should I avoid before bed to improve my sleep?",
        "How can I relax before bed to help with my depression?",
        "What if I can't sleep after 15 minutes and feel anxious?",
        "How can I create a sleep routine to support my mental health?",
        "Should I nap during the day if I have trouble sleeping at night?",
        "How can I reduce caffeine intake to improve my sleep?",
        "What should my bedroom be like for better sleep and mood?",
        "How can I deal with sleep problems related to depression?",
        "What are common sleep tips for improving mental health?"
      ],
      "responses": [
        "To improve your sleep and help with depression, avoid going to bed unless you are sleepy. Find something relaxing to do, like reading a book or listening to soft music.",
        "Avoid watching TV or using electronic devices before bed. The light from screens can delay sleep and be too stimulating, which can negatively affect your mood.",
        "If you can't sleep after 15 minutes, get out of bed and do something relaxing until you feel sleepy again. Avoid stimulating activities and keep lights low to support better sleep.",
        "Establish a relaxing bedtime routine, such as taking a warm bath, changing into pyjamas, or reading away from your bedroom. This can help improve your sleep and mood.",
        "Go to bed and wake up at the same time every day to help your body establish a sleep routine. This consistency can support better mental health.",
        "Avoid naps if possible. If you must nap, keep it short (less than 30 minutes) to ensure you are sleepy at bedtime and support better sleep patterns.",
        "Keep a regular schedule for meals, medications, and other activities to maintain your body's internal clock, which can improve both sleep and mood.",
        "Only use your bedroom for sleep and sex. Avoid reading, eating, watching TV, or using electronic devices in bed to create a strong mental association with sleep.",
        "Limit caffeine intake at least four hours before bedtime and avoid nicotine before bed. Both are stimulants that can disrupt sleep and negatively affect your mood.",
        "Avoid using alcohol to help you sleep. While it might help you fall asleep initially, it can disrupt sleep later in the night and worsen symptoms of depression.",
        "Don't go to bed hungry, but avoid large meals near bedtime. If you use sleep medication, consult your GP before stopping to ensure a smooth transition.",
        "Keep a worry diary by your bed to jot down any anxious thoughts, so you can deal with them the next day. Ensure your bedroom is dark, quiet, cool, and comfortable for better sleep."
      ]
    },
    {
      "tag": "increasing_activity_levels",
      "patterns": [
        "How can I increase my activity levels to improve my mood?",
        "What is Behavioural Activation?",
        "How does low mood affect my activities?",
        "Why do I stop doing things when I'm depressed?",
        "How can I break the cycle of low mood?",
        "What types of activities should I include in my routine?",
        "How can I plan my activities to feel better?",
        "Why is it important to stay active when feeling low?",
        "What is the impact of avoiding activities when depressed?",
        "How do I start Behavioural Activation?"
      ],
      "responses": [
        "Low mood can lead us to think more negatively, affect us physically, and reduce our typical behaviors. Behavioural Activation helps by increasing reinforcement of helpful behaviors and reducing unhelpful ones.",
        "When feeling low or depressed, activities seem harder to do, leading to less activity and withdrawal from things we enjoy. This avoidance gives short-term relief but maintains low mood in the long-term.",
        "Behavioural Activation aims to break this vicious cycle by scheduling different types of activities and following the plan regardless of mood. It includes Routine, Pleasurable, and Necessary activities.",
        "Routine activities include regular tasks like waking up, general hygiene, and housework. Pleasurable activities are hobbies and social events, while Necessary activities are time-limited tasks like paying bills.",
        "To start Behavioural Activation, create a list of Routine, Necessary, and Pleasurable activities, organize them by difficulty, schedule them, follow the plan, and review your progress weekly.",
        "Planning and sticking to activities increases motivation and breaks the cycle of depression. It's important not to wait until you feel like doing an activity, but to follow your plan.",
        "If you encounter barriers like lack of motivation or finding tasks too difficult, start small, reschedule activities, and seek support from friends or partners."
      ]
    },
    {
      "tag": "facing_your_fears",
      "patterns": [
        "What is Graded Exposure?",
        "How can I face my fears?",
        "Why do I avoid situations that make me anxious?",
        "How does Graded Exposure work?",
        "What are the steps of Graded Exposure?",
        "How can I gradually face my fears?",
        "What should I do if I feel too anxious during exposure?",
        "How does anxiety impact my behavior?",
        "What are safety seeking behaviors?",
        "How can I create an exposure ladder?"
      ],
      "responses": [
        "Graded Exposure helps you gradually face situations you fear in manageable steps. It involves exposing yourself to the feared situation without avoiding or escaping, allowing your anxiety to reduce naturally.",
        "Avoiding feared situations gives short-term relief but maintains anxiety in the long-term. Graded Exposure helps break this cycle by reducing anxiety through repeated, prolonged exposure without distraction.",
        "To start Graded Exposure, make a list of situations that cause anxiety, rank them from least to most anxiety-provoking, and create an exposure ladder. Begin with the least difficult step.",
        "Each exposure task should be repeated several times a week. Stay in the situation until your anxiety reduces by at least half. Avoid distractions and safety behaviors to let your body learn it can cope.",
        "If a step feels too difficult, make it easier or use support for the first attempt. If it's too easy, check if you're using distraction techniques. Ensure you're not too busy to commit to the process.",
        "Graded Exposure can help you gradually face and overcome situations you avoid due to anxiety, leading to reduced fear and increased confidence."
      ]
    },
    {
      "tag": "containing_worry",
      "patterns": [
        "I can't stop worrying",
        "How can I manage my worrying?",
        "What should I do if I'm constantly worrying?",
        "I'm overwhelmed by worry, what can I do?",
        "How can I control my worry?",
        "I feel like I'm worrying too much, what should I do?"
      ],
      "responses": [
        "It sounds like you're struggling with overwhelming worry. One technique that might help is called 'Containing Worry.' It involves setting aside a specific time each day to worry and writing down your worries as they come up. Would you like me to explain the steps of Containing Worry in more detail?"
      ]
    },
    {
      "tag": "explain_containing_worry",
      "patterns": [
        "Yes, please explain Containing Worry",
        "Sure, tell me more about Containing Worry",
        "I'd like to know more about Containing Worry",
        "Could you explain the steps of Containing Worry?",
        "I'm interested in learning about Containing Worry"
      ],
      "responses": [
        "Containing Worry is a technique designed to help you manage overwhelming worry by setting aside specific time slots for worrying. Here are the steps involved:",
        "Containing Worry can be really effective for managing excessive worrying. Let me walk you through the steps so you can try it out:",
        "Here's how Containing Worry works. It's a simple technique that can make a big difference in managing your worry. Let's go through the steps together:"
      ]
    },
    {
      "tag": "steps_containing_worry",
      "patterns": [
        "What are the steps of Containing Worry?",
        "Can you outline the process of Containing Worry?",
        "I need to know the steps for Containing Worry",
        "Could you explain each step of Containing Worry?",
        "Can you break down the Containing Worry technique for me?"
      ],
      "responses": [
        "Sure, here are the steps for practicing Containing Worry:",
        "Absolutely, let me outline the process of Containing Worry for you:",
        "Let me walk you through each step of the Containing Worry technique:",
        "Here's a breakdown of the steps for practicing Containing Worry:",
        "Sure thing, here's a step-by-step guide to practicing Containing Worry:"
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 1 of Containing Worry?",
        "Can you explain the first step of Containing Worry?",
        "Tell me more about the initial step of Containing Worry",
        "What's the first thing I should do in Containing Worry?",
        "I'd like to understand step 1 of Containing Worry"
      ],
      "responses": [
        "1. Schedule your worry time."
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 2 of Containing Worry?",
        "Can you explain the second step of Containing Worry?",
        "Tell me more about the second step of Containing Worry",
        "What's the next step after scheduling worry time in Containing Worry?",
        "I'd like to understand step 2 of Containing Worry"
      ],
      "responses": [
        "2. Practice mindfulness."
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 3 of Containing Worry?",
        "Can you explain the third step of Containing Worry?",
        "Tell me more about the third step of Containing Worry",
        "What's the next thing to do after practicing mindfulness in Containing Worry?",
        "I'd like to understand step 3 of Containing Worry"
      ],
      "responses": [
        "3. Try a body scan to release tension."
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 4 of Containing Worry?",
        "Can you explain the fourth step of Containing Worry?",
        "Tell me more about the fourth step of Containing Worry",
        "What should I do after releasing tension through a body scan in Containing Worry?",
        "I'd like to understand step 4 of Containing Worry"
      ],
      "responses": [
        "4. Practice gratitude to counterbalance worry."
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 5 of Containing Worry?",
        "Can you explain the fifth step of Containing Worry?",
        "Tell me more about the fifth step of Containing Worry",
        "What's the next thing to do after practicing gratitude in Containing Worry?",
        "I'd like to understand step 5 of Containing Worry"
      ],
      "responses": [
        "5. Limit your exposure to stressors."
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 6 of Containing Worry?",
        "Can you explain the sixth step of Containing Worry?",
        "Tell me more about the sixth step of Containing Worry",
        "What should I do after limiting exposure to stressors in Containing Worry?",
        "I'd like to understand step 6 of Containing Worry"
      ],
      "responses": [
        "6. Share your worries with someone you trust."
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 7 of Containing Worry?",
        "Can you explain the seventh step of Containing Worry?",
        "Tell me more about the seventh step of Containing Worry",
        "What's the next thing to do after sharing worries with someone in Containing Worry?",
        "I'd like to understand step 7 of Containing Worry"
      ],
      "responses": [
        "7. Set realistic expectations for yourself."
      ]
    },
    {
      "tag": "steps_containing_worry_detail",
      "patterns": [
        "What is step 8 of Containing Worry?",
        "Can you explain the eighth step of Containing Worry?",
        "Tell me more about the eighth step of Containing Worry",
        "What should I do after setting realistic expectations in Containing Worry?",
        "I'd like to understand step 8 of Containing Worry"
      ],
      "responses": [
        "8. Accept what you can't control."
      ]
    },
    {
      "tag": "depression_situation",
      "patterns": [
        "I didn’t get the job I went to an interview for last week.",
        "I applied for a job and didn't get it."
      ],
      "responses": [
        "I'm sorry to hear that. Not getting a job you were hoping for can be really disheartening."
      ]
    },
    {
      "tag": "depression_feeling",
      "patterns": [
        "Lying in bed, not wanting to get up and start the day.",
        "Feeling low and lacking energy to start the day."
      ],
      "responses": [
        "It sounds like you're experiencing a lack of motivation and energy, which are common symptoms of depression."
      ]
    },
    {
      "tag": "depression_thoughts",
      "patterns": [
        "I am no good.",
        "I should give up now; I’ll never find a job I enjoy.",
        "My family are disappointed in me.",
        "My friends think I am a joke.",
        "There is no point applying for jobs as I won’t get them."
      ],
      "responses": [
        "It's understandable to have negative thoughts after facing disappointment. Remember, these thoughts don't define your worth."
      ]
    },
    {
      "tag": "depression_interview_feedback",
      "patterns": [
        "They gave me feedback that pointed out ways I had impressed them.",
        "The interviewers provided some positive feedback despite not getting the job."
      ],
      "responses": [
        "It's great that you received positive feedback amidst the disappointment. Focus on these aspects as strengths for future opportunities."
      ]
    },
    {
      "tag": "depression_alternative_thoughts",
      "patterns": [
        "That means I have to carry on applying for jobs and use interview techniques.",
        "I can learn from this experience and improve my interview skills for future opportunities."
      ],
      "responses": [
        "Absolutely! Persistence and learning from each experience are key to finding success in the job search."
      ]
    },
    {
      "tag": "depression_action_plan",
      "patterns": [
        "What steps can I take to feel better?",
        "How can I manage these feelings?",
        "What can I do to improve my mood?"
      ],
      "responses": [
        "Develop a wellbeing blueprint to identify triggers and manage difficult situations effectively."
      ]
    },
    {
      "tag": "depression_further_reading",
      "patterns": [
        "Can you recommend any books or resources to help with depression?",
        "Where can I find more information on managing depression?"
      ],
      "responses": [
        "Explore resources like 'Overcoming Anxiety' by Helen Kennelly or 'Feeling Good Handbook' by David Burns for additional support and guidance."
      ]
    },
    {
      "tag": "gratitude",
      "patterns": [
        "Thank you so much",
        "I really appreciate your help",
        "Thanks a lot",
        "I'm grateful for your support",
        "You've been so helpful"
      ],
      "responses": [
        "You're most welcome! I'm here to support you anytime.",
        "It's my pleasure to help. Let me know if there's anything else you need.",
        "Thank you for trusting me. I'm always here for you.",
        "I'm glad I could help. Remember, you're not alone in this."
      ]
    },
    {
      "tag": "suicide_prevention",
      "patterns": [
        "I feel like ending my life",
        "I don't want to live anymore",
        "I think about suicide often",
        "I have suicidal thoughts",
        "I can't go on like this"
      ],
      "responses": [
        "I'm so sorry you're feeling this way. Please know that you're not alone, and there are people who care deeply about you.",
        "Your life is precious, and there is help available. Please reach out to a trusted friend, family member, or a mental health professional immediately.",
        "If you're in immediate danger, please call emergency services or a suicide hotline. In India, you can contact the Suicide Prevention Helpline at 9152987821.",
        "You matter, and your feelings are valid. Let's talk about what's going on and find a way to help you through this."
      ]
    },
    {
      "tag": "mental_health_apps",
      "patterns": [
        "What apps can help with mental health?",
        "Are there any apps for anxiety?",
        "Can you recommend apps for depression?",
        "What apps should I use for mindfulness?",
        "Are there apps to help me sleep better?"
      ],
      "responses": [
        "There are many great apps to help with mental health. For anxiety and stress, you can try 'Calm' or 'Headspace' for meditation and mindfulness.",
        "If you're dealing with depression, 'Woebot' is a chatbot that uses CBT techniques to help you manage your mood.",
        "For better sleep, 'Sleep Cycle' and 'Insight Timer' are excellent apps that offer guided meditations and sleep tracking.",
        "If you're looking for mood tracking, 'Daylio' and 'Moodpath' can help you monitor your emotions and identify patterns.",
        "Remember, while apps can be helpful, they are not a substitute for professional help. If you're struggling, please reach out to a mental health professional."
      ]
    },
    {
      "tag": "loneliness",
      "patterns": [
        "I feel so lonely",
        "I have no one to talk to",
        "I feel isolated",
        "I don't have any friends",
        "I feel disconnected from everyone"
      ],
      "responses": [
        "Loneliness can be really tough. It's important to remember that you're not alone, even if it feels that way. Let's talk about what's going on.",
        "Sometimes reaching out to someone, even if it's just a small conversation, can help. Would you like to talk about how you're feeling?",
        "There are communities and support groups, both online and offline, where you can connect with others who might be feeling the same way.",
        "If you're comfortable, you could try joining a club, group, or online community that shares your interests. It can be a great way to meet new people."
      ]
    },
    {
      "tag": "anger",
      "patterns": [
        "I'm so angry",
        "I can't control my anger",
        "I feel furious",
        "I'm losing my temper",
        "I feel like lashing out"
      ],
      "responses": [
        "Anger is a natural emotion, but it can be overwhelming. Let's talk about what's causing this anger and how we can manage it.",
        "Taking deep breaths or stepping away from the situation for a moment can help you calm down. Would you like some relaxation techniques?",
        "It's okay to feel angry, but it's important to find healthy ways to express it. Talking about it can help you process your feelings.",
        "If you're feeling like you might hurt yourself or others, please reach out to someone you trust or a professional immediately."
      ]
    },
    {
      "tag": "fear",
      "patterns": [
        "I'm scared",
        "I feel afraid",
        "I can't stop worrying",
        "I feel like something bad will happen",
        "I'm terrified"
      ],
      "responses": [
        "Fear can be paralyzing, but you're not alone. Let's talk about what's making you feel this way and how we can work through it.",
        "Sometimes, breaking down what you're afraid of into smaller parts can make it feel more manageable. Would you like to try that?",
        "It's okay to feel scared. Fear is a natural response, but it doesn't have to control you. Let's find ways to help you feel safer.",
        "If your fear is overwhelming, consider reaching out to a therapist or counselor who can help you work through these feelings."
      ]
    },
    {
      "tag": "hopelessness",
      "patterns": [
        "I feel hopeless",
        "Nothing will ever get better",
        "I see no way out",
        "I feel like giving up",
        "I can't see a future"
      ],
      "responses": [
        "I'm so sorry you're feeling this way. It's important to remember that feelings of hopelessness can pass, even if it doesn't feel like it right now.",
        "You're not alone in this. Let's talk about what's making you feel this way and see if we can find even a small glimmer of hope.",
        "Sometimes, taking things one step at a time can help. What's one small thing you can do today to take care of yourself?",
        "If you're feeling overwhelmed, please reach out to a trusted friend, family member, or mental health professional. You don't have to face this alone."
      ]
    },
    {
      "tag": "self_esteem",
      "patterns": [
        "I feel worthless",
        "I hate myself",
        "I don't think I'm good enough",
        "I have no confidence",
        "I feel like a failure"
      ],
      "responses": [
        "I'm sorry you're feeling this way. You are valuable and deserving of love and respect, even if it's hard to see that right now.",
        "It's easy to be hard on ourselves, but try to treat yourself with the same kindness you would show a friend. Let's talk about what's making you feel this way.",
        "Building self-esteem takes time, but small steps can make a big difference. What's one thing you like about yourself, even if it's small?",
        "If you're struggling with self-esteem, consider talking to a therapist who can help you work through these feelings and build confidence."
      ]
    },
    {
      "tag": "grief",
      "patterns": [
        "I'm grieving a loss",
        "I lost someone I love",
        "I can't stop thinking about them",
        "I feel so much pain",
        "I don't know how to move on"
      ],
      "responses": [
        "Grief is one of the hardest emotions to deal with. It's okay to feel this way, and there's no timeline for healing. Let's talk about how you're feeling.",
        "It's important to allow yourself to feel the pain and not rush the process. Would you like to share a memory of the person you lost?",
        "Grief can feel overwhelming, but you don't have to go through it alone. Consider reaching out to a support group or counselor who can help you through this.",
        "Remember, it's okay to take things one day at a time. Healing is a process, and it's okay to ask for help along the way."
      ]
    },
    {
      "tag": "guilt",
      "patterns": [
        "I feel so guilty",
        "I can't forgive myself",
        "I did something terrible",
        "I regret my actions",
        "I feel ashamed"
      ],
      "responses": [
        "Guilt can be a heavy burden to carry. Let's talk about what's making you feel this way and see if we can find a way to work through it.",
        "It's important to remember that everyone makes mistakes. What's done is done, but you can learn from it and grow.",
        "If you're feeling guilty about something, consider talking to someone you trust or a therapist who can help you process these feelings.",
        "Forgiving yourself is a process, and it takes time. Be patient with yourself and focus on what you can do moving forward."
      ]
    },
    {
      "tag": "shame",
      "patterns": [
        "I feel so ashamed",
        "I can't face anyone",
        "I feel like I've let everyone down",
        "I'm embarrassed about myself",
        "I feel like hiding"
      ],
      "responses": [
        "Shame can be a very isolating feeling, but you're not alone. Let's talk about what's making you feel this way and how we can work through it.",
        "It's important to remember that everyone makes mistakes, and you are not defined by your past actions. Let's focus on how you can move forward.",
        "If you're feeling ashamed, consider talking to someone you trust or a therapist who can help you process these feelings.",
        "You are worthy of love and respect, even if it's hard to see that right now. Let's find ways to help you feel better about yourself."
      ]
    },
    {
      "tag": "jealousy",
      "patterns": [
        "I feel so jealous",
        "I can't stop comparing myself to others",
        "I envy their success",
        "I feel bitter about others",
        "I wish I had what they have"
      ],
      "responses": [
        "Jealousy is a natural emotion, but it can be hard to deal with. Let's talk about what's making you feel this way and how we can work through it.",
        "It's easy to compare ourselves to others, but remember that everyone's journey is different. Focus on your own progress and what makes you unique.",
        "If you're feeling jealous, try to channel that energy into something positive, like setting a new goal or working on a project you're passionate about.",
        "Jealousy often stems from insecurity. Let's talk about what's making you feel this way and how we can build your confidence."
      ]
    },
    {
      "tag": "boredom",
      "patterns": [
        "I'm so bored",
        "Nothing interests me",
        "I feel like I'm wasting my time",
        "I can't find motivation",
        "I feel stuck"
      ],
      "responses": [
        "Boredom can be frustrating, but it can also be an opportunity to explore new interests. What's something you've always wanted to try?",
        "Sometimes, boredom is a sign that we need a change. Let's talk about what you're passionate about and how we can bring more excitement into your life.",
        "If you're feeling stuck, consider trying something new, like a hobby, a class, or even just a walk in a new place. It can help break the monotony.",
        "Boredom can also be a chance to reflect on what you really want in life. Let's talk about your goals and how we can work towards them."
      ]
    },
    {
      "tag": "overwhelm",
      "patterns": [
        "I feel so overwhelmed",
        "I can't handle everything",
        "I'm drowning in tasks",
        "I feel like I'm losing control",
        "Everything is too much"
      ],
      "responses": [
        "Feeling overwhelmed is completely valid, especially when there's a lot going on. Let's break things down into smaller, manageable steps.",
        "It's okay to take a step back and prioritize what's most important. What's one thing you can focus on right now?",
        "If you're feeling overwhelmed, try to take a few deep breaths and give yourself a moment to regroup. You don't have to do everything at once.",
        "Remember, it's okay to ask for help. Whether it's from a friend, family member, or professional, you don't have to face everything alone."
      ]
    },
    {
      "tag": "confusion",
      "patterns": [
        "I feel so confused",
        "I don't know what to do",
        "I can't make a decision",
        "I feel lost",
        "I don't understand what's happening"
      ],
      "responses": [
        "Confusion can be really frustrating, but it's okay to not have all the answers right now. Let's talk through what's going on and see if we can find clarity.",
        "Sometimes, writing things down or making a list can help clear your mind. Would you like to try that?",
        "If you're feeling confused, it might help to talk to someone you trust or a professional who can help you sort through your thoughts.",
        "It's okay to take things one step at a time. You don't have to figure everything out right away. Let's focus on what you can do right now."
      ]
    },
    {
      "tag": "relief",
      "patterns": [
        "I feel so relieved",
        "A weight has been lifted",
        "I feel like I can breathe again",
        "I'm so glad that's over",
        "I feel lighter"
      ],
      "responses": [
        "I'm so glad you're feeling relieved! It's amazing how much better things can feel when a burden is lifted.",
        "Relief is such a wonderful feeling. Take a moment to enjoy it and celebrate the progress you've made.",
        "It's great to hear that you're feeling better. Let's talk about what helped you get to this point and how we can keep moving forward.",
        "Relief can be a sign that you're on the right track. Let's build on this positive feeling and see what else we can accomplish."
      ]
    },
    {
      "tag": "excitement",
      "patterns": [
        "I feel so excited",
        "I can't wait",
        "I'm really looking forward to this",
        "I feel energized",
        "I'm thrilled"
      ],
      "responses": [
        "That's wonderful to hear! Excitement is such a positive and energizing emotion. What's got you feeling this way?",
        "I'm so happy for you! Let's talk about what's making you excited and how we can keep that positive energy going.",
        "Excitement can be contagious! It's great to see you feeling so enthusiastic. Let's make the most of this moment.",
        "It's amazing to feel excited about something. Let's channel that energy into making the most of this opportunity."
      ]
    },
    {
      "tag": "pride",
      "patterns": [
        "I feel so proud",
        "I accomplished something great",
        "I'm really proud of myself",
        "I feel like I've achieved something",
        "I'm so happy with my progress"
      ],
      "responses": [
        "That's amazing! You should be proud of yourself. Let's celebrate this achievement and all the hard work you've put in.",
        "I'm so happy for you! It's important to recognize and celebrate your accomplishments. What's next for you?",
        "Feeling proud is such a great feeling. Let's talk about what you've achieved and how we can build on this success.",
        "You deserve to feel proud of yourself. Let's take a moment to appreciate how far you've come and what you've accomplished."
      ]
    },
    {
      "tag": "love",
      "patterns": [
        "I feel so loved",
        "I'm in love",
        "I feel so connected to someone",
        "I feel cared for",
        "I feel appreciated"
      ],
      "responses": [
        "That's wonderful to hear! Love is such a powerful and positive emotion. Let's talk about what's making you feel this way.",
        "I'm so happy for you! Feeling loved and appreciated is such a great feeling. Let's celebrate this connection.",
        "Love can bring so much joy and fulfillment. Let's talk about how you can nurture this feeling and keep it strong.",
        "It's amazing to feel loved and cared for. Let's focus on how you can continue to build and strengthen these relationships."
      ]
    },
    {
      "tag": "disappointment",
      "patterns": [
        "I feel so disappointed",
        "Things didn't go as planned",
        "I feel let down",
        "I expected more",
        "I'm really upset about this"
      ],
      "responses": [
        "I'm sorry things didn't go as planned. Disappointment can be really tough, but it's important to remember that setbacks are a part of life.",
        "It's okay to feel disappointed. Let's talk about what happened and how we can move forward from here.",
        "Disappointment can be hard to deal with, but it's also an opportunity to learn and grow. Let's focus on what you can do next.",
        "It's okay to feel upset when things don't go as planned. Let's talk about how you're feeling and see if we can find a way to move forward."
      ]
    },
    {
      "tag": "regret",
      "patterns": [
        "I regret my decision",
        "I wish I had done things differently",
        "I feel so much regret",
        "I can't stop thinking about what I did",
        "I feel like I made a mistake"
      ],
      "responses": [
        "Regret can be really painful, but it's important to remember that everyone makes mistakes. Let's talk about what's making you feel this way.",
        "It's okay to feel regret, but try not to dwell on it too much. What's done is done, and now we can focus on what you can do moving forward.",
        "If you're feeling regret, consider talking to someone you trust or a therapist who can help you process these feelings.",
        "Regret can be a sign that you've learned something important. Let's focus on how you can use this experience to grow and make better decisions in the future."
      ]
    }
  ]
}